IDEA StatiCa Open Model
ArcSegment3D.Point Property
Compatible with IDEA StatiCa Beta 21.0 - beta
 Gets or sets the reference to Point3D of circular arc somewhere between start and end point.
 Namespace: IdeaRS.OpenModel.Geometry3D
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public ReferenceElement Point { get; set; }
Public Property Point As ReferenceElement
	Get
	Set
public:
property ReferenceElement^ Point {
	ReferenceElement^ get ();
	void set (ReferenceElement^ value);
}
Property Value
Type: ReferenceElement
See Also
Reference
ArcSegment3D Class
IdeaRS.OpenModel.Geometry3D Namespace